[
  {
    "version": "1.10.3",
    "changes": [
      "Add additional page export error fallback.",
      "Temporarily disable video & gifv embeds in exported HTML."
    ]
  },
  {
    "version": "1.10.2",
    "changes": [
      "Add support for embedded gifv files.",
      "Allow previewing of video attachments.",
      "Adjust export toggle option verbiage."
    ]
  },
  {
    "version": "1.10.1",
    "changes": [
      "Fix search bug where search ends too soon and not all messages are found."
    ]
  },
  {
    "version": "1.10.0",
    "changes": [
      "Add ability to enter a UserId in the Username Prefilter field (Channel Messages only).",
      "Clicking a User's avatar will now copy their UserId to your clipboard.",
      "Add ability to Purge Channel Messages by a specified User Id.",
      "Include external image URL's as part of the exported images and show previews on Channel/DM exports.",
      "Embed video links into Channel/DM exports.",
      "Make previewed images in export files expand when hovered over."
    ]
  },
  {
    "version": "1.9.1",
    "changes": [
      "Revert extension icon redirect changes to restore Discord only permissions."
    ]
  },
  {
    "version": "1.9.0",
    "changes": [
      "Clicking extension icon outside of Discord app will now redirect to the Discord website.",
      "Show 'Authentication Failure' message when Discrub is unable to authenticate the session.",
      "Move optional filters to an 'Advanced Filtering' section."
    ]
  },
  {
    "version": "1.8.14",
    "changes": [
      "Resolve broken Search/Purge issues.",
      "Prevent Channel categories from showing up in the Channel dropdown."
    ]
  },
  {
    "version": "1.8.13",
    "changes": [
      "Add streamSaver serviceworker to extension files.",
      "Prevent export errors from breaking entire export and print error message and stack trace to file."
    ]
  },
  {
    "version": "1.8.12",
    "changes": [
      "Fix very large exports by performing them as rolling downloads.",
      "Screen size and style adjustments."
    ]
  },
  {
    "version": "1.8.11",
    "changes": ["Patch fix for message timezones."]
  },
  {
    "version": "1.8.10",
    "changes": [
      "Force UTF-8 on generated HTML to fix issues with emojis and other languages rendering as gibberish.",
      "Add ability to search messages before and after a given date."
    ]
  },
  {
    "version": "1.8.9",
    "changes": [
      "Show page number on export title.",
      "Fix infinite loop bug when export is cancelled during compression step.",
      "Update criteria for images to eligible for preview."
    ]
  },
  {
    "version": "1.8.8",
    "changes": ["Patch fix for image previews not working correctly."]
  },
  {
    "version": "1.8.7",
    "changes": [
      "Fix replied to message avatar bug.",
      "Add ability to specifiy messages per page when exporting."
    ]
  },
  {
    "version": "1.8.6",
    "changes": [
      "Messages that are sorted are now also sorted when exported.",
      "Add support for replied to messages.",
      "Add ability to jump to replied to messages in an export file.",
      "Make previewing images and showing avatars optional for exports."
    ]
  },
  {
    "version": "1.8.5",
    "changes": [
      "Add ability to toggle image downloading when exporting.",
      "Reset filtered messages after toggling off filters.",
      "Fix numerous export issues.",
      "Bug fix for switching tabs while searching messages."
    ]
  },
  {
    "version": "1.8.4",
    "changes": ["Small graphical adjustments."]
  },
  {
    "version": "1.8.3",
    "changes": ["Improve message filter performance."]
  },
  {
    "version": "1.8.2",
    "changes": [
      "Reset pre-filter user if Channel selection is reset.",
      "Add ability to view message embed(s).",
      "Include message embed(s) when filtering by message content."
    ]
  },
  {
    "version": "1.8.1",
    "changes": [
      "Patch fix for additional export formatting graphical issues.",
      "Fix Purge dialog warning styling.",
      "Disable main Export buttons during unnecessary/unneeded scenarios."
    ]
  },
  {
    "version": "1.8.0",
    "changes": ["Re-design and refactor message export formatting."]
  },
  {
    "version": "1.7.9",
    "changes": [
      "Make Purge warning more apparant and disable Purge button in scenarios that are not needed."
    ]
  },
  {
    "version": "1.7.8",
    "changes": [
      "Add dismissable announcements to Discrub.",
      "Improve loading text while exporting Guilds/DMs."
    ]
  },
  {
    "version": "1.7.7",
    "changes": ["Switch to Discord's v10 API."]
  },
  {
    "version": "1.7.6",
    "changes": ["Add Purge option to DM's.", "Add Export feature to DM's."]
  },
  {
    "version": "1.7.5",
    "changes": [
      "Add Guild Export feature, which allows User to select all or some channels to export into a combined .ZIP file (also downloads image attachments). Messages can be exported into HTML or JSON. ",
      "Adjustments to versioning and window dimensions.",
      "Move Channel/Direct Message selection boxes on one row to reduce vertical screen waste."
    ]
  },
  {
    "version": "1.6.5",
    "changes": [
      "Clicking extension icon will open Discrub without requiring second button click.",
      "Hide thread filter when filtering Direct Messages.",
      "Small improvement to scroll behavior, Discub should look a bit better on smaller screens now."
    ]
  },
  {
    "version": "1.6.4",
    "changes": [
      "Add Purge Guild feature - Users can now select a Guild and click the Purge button, which will delete all of the users messages within all Channels.",
      "Fix bug where the DM Pre-filter selection would carry over to the next selected DM."
    ]
  },
  {
    "version": "1.5.4",
    "changes": [
      "Stop delete function from breaking the extension if an unknown error occurs."
    ]
  },
  {
    "version": "1.5.3",
    "changes": [
      "Add the ability to pre-filter messages by username, this will allow faster searching if only looking for messages for a specific user.",
      "One limitation of the pre-filter feature is that Channel Messages can only be pre-filtered by your own username due to Discord API restrictions. Direct Messages do not have this limitation.",
      "The second pre-filter limitation is that messages within Archived Threads are not able to be found by pre-filtering, these messages can be found however by not using the pre-filter feature. Active/Unarchived Threads can still be found by pre-filtering."
    ]
  },
  {
    "version": "1.4.3",
    "changes": [
      "Add ability to open extension dialog via the Chrome extension popup button."
    ]
  },
  {
    "version": "1.3.3",
    "changes": [
      "Fix bug where deleting/editing direct messages would crash the extension.",
      "Add support for Discord threads.",
      "Due to a Discord API limitation, active threads that have had the first message deleted are unable to be found by Discrub for the time being. (However archiving a thread, then finding it on Discrub, and then unarchiving it in a separate tab will allow you to edit/delete messages for this specific scenario)."
    ]
  },
  {
    "version": "1.2.3",
    "changes": [
      "Hide disabled 'Nuke Account' tab.",
      "Add r/discrub subreddit link to General Information tab."
    ]
  },
  {
    "version": "1.2.2",
    "changes": [
      "Fix bug where active filters did not affect the messages exported.",
      "Adjustments to Attachment Modal.",
      "Style changes to Message Table."
    ]
  },
  {
    "version": "1.2.1",
    "changes": [
      "Fix bug where message filters did not reset behind the scenes.",
      "Rename 'About' tab to 'General Information', refactor layout."
    ]
  },
  {
    "version": "1.2.0",
    "changes": [
      "Add ability to export to the following file formats: HTML, PDF, and JSON.",
      "Behind the scenes performance enhancements."
    ]
  },
  {
    "version": "1.1.0",
    "changes": ["Add ability to filter messages by attachment name."]
  }
]
