[
  {
    "version": "1.12.10",
    "changes": [
      "Name exported thread and forums posts according to the relevant title, replacing the 'Thread X' naming scheme.",
      "Enable the 'Separate Threads & Forum Posts' and 'Artist Mode' settings by default.",
      "When the 'Separate Threads & Forum Posts' setting is enabled during an export, media belonging to threads or forum posts will now be stored in a separate and distinguished folder.",
      "Media downloaded as part of an export will now use the message it originated from as the file's Last Modified attribute, to better ensure the files can be sorted sequentially.",
      "HTML exports will now show a Channel description popup when the Channel name on the top-left of the page, is clicked.",
      "Filenames with invalid characters, and filename randomization are now better handled when performing exports.",
      "Dates can now be manually entered into the date selection field.",
      "Exports and searches now show a progress log.",
      "Style adjustments to the reaction pop-up on HTML exports."
    ]
  },
  {
    "version": "1.12.9",
    "changes": [
      "Make reaction fetching opt-in by default, it now must be manually toggled in settings if using the extension for the first time.",
      "Remove 'No' option from Pinned Messages search criteria, since the Discord search API seems to ignore that particular case.",
      "Properly parse file extensions when attachments and embeds are downloaded in an export.",
      "Fixes for the Ko-Fi feed styling.",
      "Only automatically show the News dialog when the current extension version matches the value defined by the remote pop_ver."
    ]
  },
  {
    "version": "1.12.8",
    "changes": [
      "Resolve display issues with calls lasting over 24 hours.",
      "Add a Time Format setting with four options to choose from.",
      "Add some additional options to the Search/Modify Delay and Delay Spread settings.",
      "Categorize Group DMs versus normal DMs in the Direct Messages screen.",
      "Use a separate News trigger for Firefox, since Firefox receives updates faster than Chrome."
    ]
  },
  {
    "version": "1.12.7",
    "changes": [
      "Distinguish non-removable messages in the Purge log, change successful removed message color.",
      "Add 'Keep Attachments' setting to Purge screen.",
      "Add ability to remove reactions from other Users.",
      "Setup reaction Purge functionality.",
      "Setup reaction deletion for already loaded and selected messages.",
      "Revamped Search/Modify Delay settings.",
      "Add Date Format setting.",
      "Fix bug where message deletes/edit/un-reacts would fail for messages in archived threads.",
      "Remove restriction that prevents message selection for non-removable messages, so that these types of messages can still have reactions removed from them."
    ]
  },
  {
    "version": "1.12.6",
    "changes": [
      "Resolve issue with Purge after reaching max search offset of 5000.",
      "Prevent message skips during Purge process."
    ]
  },
  {
    "version": "1.12.5",
    "changes": [
      "Search Criteria can now support selections with multiple Users.",
      "Purge Dialog has been overhauled.",
      "User data can now be cached, to prevent unnecessary lookups, new setting has been added to adjust frequency of refresh.",
      "Add Pinned to Search Criteria.",
      "Add Mentioned Users to Search Criteria.",
      "Add Channels to Search Criteria (Purge only).",
      "Purging now deletes messages as they are found.",
      "Show settings on Export dialog."
    ]
  },
  {
    "version": "1.12.4",
    "changes": [
      "Paginate Ko-Fi Feed and make feed hide-able.",
      "Clean up export dialog view.",
      "Support video embed previewing from any source (HTML).",
      "Preview images from Article embeds, when the respective setting is toggled (HTML).",
      "Add Embed Image and Video to Download Media categories (export).",
      "Make message table pagination sticky.",
      "Fix issue with rendered code formatted messages and add code highlighting support."
    ]
  },
  {
    "version": "1.12.3",
    "changes": ["Auxillary changes for Firefox."]
  },
  {
    "version": "1.12.2",
    "changes": [
      "Add 'Thread' and 'Thread Starter' to Quick Filtering's Message Type/Category field.",
      "Resolve Chrome Security Policy issue that broke extension following Chrome 130 update.",
      "Prevent delete attempts on non-deletable messages."
    ]
  },
  {
    "version": "1.12.1",
    "changes": [
      "Make Preview/Download Media settings multi-select with 'Images', 'Videos', and 'Audio' as options."
    ]
  },
  {
    "version": "1.12.0",
    "changes": [
      "Export Options are now saved as settings.",
      "Prevent Ko-Fi feed error from breaking extension.",
      "Quick Filtering has been revamped.",
      "Advanced Filtering has been revamped.",
      "Channel Pin notifications are now rendered properly.",
      "Image Display Mode export setting has been added.",
      "Message Type/Category Quick Filter now has Pinned, Pin Notification, Call, and Reaction options added.",
      "Multi-DM exports and purges are now supported.",
      "Page controls have been added to the bottom of HTML exports.",
      "Using the 'Select All' button on a filtered Server export Channel list now only selects from the filtered list.",
      "Search & Delete/Edit random delay settings have been added."
    ]
  },
  {
    "version": "1.11.16",
    "changes": [
      "Adjust CSV exports so that all columns from dataset are included.",
      "Make 'Username', 'Attachment Name', and 'Message' Quick Filters accept multiple values."
    ]
  },
  {
    "version": "1.11.15",
    "changes": [
      "Fix export issue when using Separate Threads & Forum Posts export option.",
      "Prevent ghost files from being created when no messages are available for export.",
      "Apply Advanced Filters to multi-Channel exports.",
      "Show Channel name on thread/forum post messages in Guild exports.",
      "Fix issue where standard emojis were not rendered properly in reaction dialog.",
      "Hide Separate Threads & Forum Posts export option for DM exports."
    ]
  },
  {
    "version": "1.11.14",
    "changes": ["Add toggle to export threads & forum post as separate files."]
  },
  {
    "version": "1.11.13",
    "changes": ["Add 'Call Log' Quick Filter to messages within a DM."]
  },
  {
    "version": "1.11.12",
    "changes": ["Fix message chaining in HTML exports for Tupperbox messages."]
  },
  {
    "version": "1.11.11",
    "changes": [
      "Add 'Lookup Server Nicknames & Roles' setting.",
      "Add 'Lookup Display Names' setting.",
      "Show APP in place of BOT when rendering messages from a Verified Bot."
    ]
  },
  {
    "version": "1.11.10",
    "changes": ["Add support for call messages.", "Order exported media."]
  },
  {
    "version": "1.11.9",
    "changes": [
      "Bug fix for HTML export crashes.",
      "Download reacting Users avatars during exports.",
      "Show loader while Guild roles are being downloaded during exports."
    ]
  },
  {
    "version": "1.11.8",
    "changes": [
      "Include voice/audio files in exports.",
      "Preview voice/audio in HTML exports.",
      "Add reaction support.",
      "Improve status text during the various tasks performed by Discrub.",
      "Add a 'Settings' menu option where reaction retrieval can be enabled or disabled."
    ]
  },
  {
    "version": "1.11.7",
    "changes": [
      "Add Channel filter for the Server Export dialog.",
      "Add the 'Media Only' and 'CSV' export options.",
      "Show an export summary when hovering over an export option.",
      "Fix critical bug with exporting multiple Server Channels.",
      "Add an Artist Mode export toggle to store Attached and Embedded Media into folders named after their Author's username.",
      "Add the ability to paste Thread Id's into the Channel field within the Channel Messages screen."
    ]
  },
  {
    "version": "1.11.6",
    "changes": [
      "Add optional skip for Message Reply Tags in the Tags screen (toggled by default).",
      "Fix display name bug on 'Tags Received For User' Tags spreadsheet."
    ]
  },
  {
    "version": "1.11.5",
    "changes": ["Add the ability to generate Channel tag data spreadsheets."]
  },
  {
    "version": "1.11.4",
    "changes": [
      "Paginate exported JSON messages.",
      "Restore username parsing for User mentions in JSON exports."
    ]
  },
  {
    "version": "1.11.3",
    "changes": [
      "Show Server role colors and icons on message authors when applicable.",
      "Automatically include Server role icons in exports.",
      "Show global/Server names when possible and fallback to username when no alternative is available.",
      "Show Channel descriptions in exports.",
      "Automatically show Server members on the 'Messages By' Advanced Filter and on the Guild Purge dialog, as they are discovered.",
      "Implement message chaining for when messages are sent within ~5 minutes between eachother.",
      "Show additional info when hovering over a Users name or mention.",
      "Show icons on the Server and DM selection fields."
    ]
  },
  {
    "version": "1.11.2",
    "changes": [
      "Show BOT tag on messages from bots.",
      "Fix issue where some emojis were not being parsed and displayed properly.",
      "Add support for the following special formatted text: bold, quote, hyperlink, Channel mention, and hyperlink.",
      "Multi-line messages will now be properly displayed in Discrub and in HTML exports.",
      "Add export support for 'rich' embeds.",
      "Slightly reduce export time by remembering User lookups when exporting multiple times during a single session.",
      "Show search progress when using Advanced Filtering."
    ]
  },
  {
    "version": "1.11.1",
    "changes": [
      "Fix bug where Guild Forum searches were not correctly fetching message data.",
      "Add 'Inverse' toggle to Quick Filters.",
      "Make the 'Thread' Quick Filter an Autocomplete field and sort options alphabetically.",
      "Fix an issue where Messages from locked/archived Threads could not be modified or Purged.",
      "Add support for Guild Emojis.",
      "Automatically download User Avatars during exports, remove Show Avatar export toggle.",
      "Add ability to collapse the Channel/Direct Message sections, automatically collapse after clicking 'Search'."
    ]
  },
  {
    "version": "1.11.0",
    "changes": [
      "Add ability to pause message Search, Export, and Purge.",
      "Include file extensions in filename for embedded media during exports.",
      "Users who are having issues with Authorization, can now manually input an Authorization Token to use Discrub.",
      "Fix bug where other Users ID's were unable to be entered into the Guild Purge textfield."
    ]
  },
  {
    "version": "1.10.18",
    "changes": [
      "Add ability to copy Guild, Channel, and DM names via autocomplete field."
    ]
  },
  {
    "version": "1.10.17",
    "changes": [
      "Add missing case to mention parse logic.",
      "Show visual feedback when looking up mentioned User data.",
      "Show progress when deleting or Purging messages.",
      "Make Quick Filtering button more apparent and smooth out Advanced Filtering show/hide animation."
    ]
  },
  {
    "version": "1.10.16",
    "changes": [
      "Fix bug where general searches used incorrect API, resulting in longer search times.",
      "Fix export issue."
    ]
  },
  {
    "version": "1.10.15",
    "changes": [
      "Make image preview expandable when viewing attachments in-app.",
      "Additional small improvements to code base."
    ]
  },
  {
    "version": "1.10.14",
    "changes": ["Add Messages Containing field to Advanced Filtering."]
  },
  {
    "version": "1.10.13",
    "changes": ["Redesign Menubar component."]
  },
  {
    "version": "1.10.12",
    "changes": [
      "Fix bug where Messages found via Advanced Filtering did not properly render mentions."
    ]
  },
  {
    "version": "1.10.11",
    "changes": [
      "Fix Advanced Filtering bug that prevented searches on DMs & Guilds"
    ]
  },
  {
    "version": "1.10.10",
    "changes": [
      "Add ability to perform searches on Guilds, without a Channel selected.",
      "Add Message Content field to Advanced Filtering."
    ]
  },
  {
    "version": "1.10.9",
    "changes": [
      "Include NSFW messages when Purging and as part of searches that use Advanced Filtering."
    ]
  },
  {
    "version": "1.10.8",
    "changes": [
      "Add ability to toggle ascending/descending message sort when bulk exporting a Guild/DM."
    ]
  },
  {
    "version": "1.10.7",
    "changes": [
      "Convert Channel Messages and Direct Message dropdown fields into autocomplete fields."
    ]
  },
  {
    "version": "1.10.6",
    "changes": [
      "Patch fix for app crash when exporting message with empty embed."
    ]
  },
  {
    "version": "1.10.5",
    "changes": [
      "Fix bug where Filtered Searching and Purging stopped after finding 5000 messages.",
      "Sort Guild, Channel, and DM dropdown options in alphanumerical order."
    ]
  },
  {
    "version": "1.10.4",
    "changes": [
      "Fix issue where attached videos were being displayed twice (once as generic and other as video element).",
      "Re-enable embedded YouTube video & all gifv in exports.",
      "Show additional Purge debug info when messages are allocated."
    ]
  },
  {
    "version": "1.10.3",
    "changes": [
      "Add additional page export error fallback.",
      "Temporarily disable video & gifv embeds in exported HTML."
    ]
  },
  {
    "version": "1.10.2",
    "changes": [
      "Add support for embedded gifv files.",
      "Allow previewing of video attachments.",
      "Adjust export toggle option verbiage."
    ]
  },
  {
    "version": "1.10.1",
    "changes": [
      "Fix search bug where search ends too soon and not all messages are found."
    ]
  },
  {
    "version": "1.10.0",
    "changes": [
      "Add ability to enter a UserId in the Username Prefilter field (Channel Messages only).",
      "Clicking a User's avatar will now copy their UserId to your clipboard.",
      "Add ability to Purge Channel Messages by a specified User Id.",
      "Include external image URL's as part of the exported images and show previews on Channel/DM exports.",
      "Embed video links into Channel/DM exports.",
      "Make previewed images in export files expand when hovered over."
    ]
  },
  {
    "version": "1.9.1",
    "changes": [
      "Revert extension icon redirect changes to restore Discord only permissions."
    ]
  },
  {
    "version": "1.9.0",
    "changes": [
      "Clicking extension icon outside of Discord app will now redirect to the Discord website.",
      "Show 'Authentication Failure' message when Discrub is unable to authenticate the session.",
      "Move optional filters to an 'Advanced Filtering' section."
    ]
  },
  {
    "version": "1.8.14",
    "changes": [
      "Resolve broken Search/Purge issues.",
      "Prevent Channel categories from showing up in the Channel dropdown."
    ]
  },
  {
    "version": "1.8.13",
    "changes": [
      "Add streamSaver serviceworker to extension files.",
      "Prevent export errors from breaking entire export and print error message and stack trace to file."
    ]
  },
  {
    "version": "1.8.12",
    "changes": [
      "Fix very large exports by performing them as rolling downloads.",
      "Screen size and style adjustments."
    ]
  },
  {
    "version": "1.8.11",
    "changes": ["Patch fix for message timezones."]
  },
  {
    "version": "1.8.10",
    "changes": [
      "Force UTF-8 on generated HTML to fix issues with emojis and other languages rendering as gibberish.",
      "Add ability to search messages before and after a given date."
    ]
  },
  {
    "version": "1.8.9",
    "changes": [
      "Show page number on export title.",
      "Fix infinite loop bug when export is cancelled during compression step.",
      "Update criteria for images to eligible for preview."
    ]
  },
  {
    "version": "1.8.8",
    "changes": ["Patch fix for image previews not working correctly."]
  },
  {
    "version": "1.8.7",
    "changes": [
      "Fix replied to message avatar bug.",
      "Add ability to specifiy messages per page when exporting."
    ]
  },
  {
    "version": "1.8.6",
    "changes": [
      "Messages that are sorted are now also sorted when exported.",
      "Add support for replied to messages.",
      "Add ability to jump to replied to messages in an export file.",
      "Make previewing images and showing avatars optional for exports."
    ]
  },
  {
    "version": "1.8.5",
    "changes": [
      "Add ability to toggle image downloading when exporting.",
      "Reset filtered messages after toggling off filters.",
      "Fix numerous export issues.",
      "Bug fix for switching tabs while searching messages."
    ]
  },
  {
    "version": "1.8.4",
    "changes": ["Small graphical adjustments."]
  },
  {
    "version": "1.8.3",
    "changes": ["Improve message filter performance."]
  },
  {
    "version": "1.8.2",
    "changes": [
      "Reset pre-filter user if Channel selection is reset.",
      "Add ability to view message embed(s).",
      "Include message embed(s) when filtering by message content."
    ]
  },
  {
    "version": "1.8.1",
    "changes": [
      "Patch fix for additional export formatting graphical issues.",
      "Fix Purge dialog warning styling.",
      "Disable main Export buttons during unnecessary/unneeded scenarios."
    ]
  },
  {
    "version": "1.8.0",
    "changes": ["Re-design and refactor message export formatting."]
  },
  {
    "version": "1.7.9",
    "changes": [
      "Make Purge warning more apparant and disable Purge button in scenarios that are not needed."
    ]
  },
  {
    "version": "1.7.8",
    "changes": [
      "Add dismissable announcements to Discrub.",
      "Improve loading text while exporting Guilds/DMs."
    ]
  },
  {
    "version": "1.7.7",
    "changes": ["Switch to Discord's v10 API."]
  },
  {
    "version": "1.7.6",
    "changes": ["Add Purge option to DM's.", "Add Export feature to DM's."]
  },
  {
    "version": "1.7.5",
    "changes": [
      "Add Guild Export feature, which allows User to select all or some channels to export into a combined .ZIP file (also downloads image attachments). Messages can be exported into HTML or JSON. ",
      "Adjustments to versioning and window dimensions.",
      "Move Channel/Direct Message selection boxes on one row to reduce vertical screen waste."
    ]
  },
  {
    "version": "1.6.5",
    "changes": [
      "Clicking extension icon will open Discrub without requiring second button click.",
      "Hide thread filter when filtering Direct Messages.",
      "Small improvement to scroll behavior, Discub should look a bit better on smaller screens now."
    ]
  },
  {
    "version": "1.6.4",
    "changes": [
      "Add Purge Guild feature - Users can now select a Guild and click the Purge button, which will delete all of the users messages within all Channels.",
      "Fix bug where the DM Pre-filter selection would carry over to the next selected DM."
    ]
  },
  {
    "version": "1.5.4",
    "changes": [
      "Stop delete function from breaking the extension if an unknown error occurs."
    ]
  },
  {
    "version": "1.5.3",
    "changes": [
      "Add the ability to pre-filter messages by username, this will allow faster searching if only looking for messages for a specific user.",
      "One limitation of the pre-filter feature is that Channel Messages can only be pre-filtered by your own username due to Discord API restrictions. Direct Messages do not have this limitation.",
      "The second pre-filter limitation is that messages within Archived Threads are not able to be found by pre-filtering, these messages can be found however by not using the pre-filter feature. Active/Unarchived Threads can still be found by pre-filtering."
    ]
  },
  {
    "version": "1.4.3",
    "changes": [
      "Add ability to open extension dialog via the Chrome extension popup button."
    ]
  },
  {
    "version": "1.3.3",
    "changes": [
      "Fix bug where deleting/editing direct messages would crash the extension.",
      "Add support for Discord threads.",
      "Due to a Discord API limitation, active threads that have had the first message deleted are unable to be found by Discrub for the time being. (However archiving a thread, then finding it on Discrub, and then unarchiving it in a separate tab will allow you to edit/delete messages for this specific scenario)."
    ]
  },
  {
    "version": "1.2.3",
    "changes": [
      "Hide disabled 'Nuke Account' tab.",
      "Add r/discrub subreddit link to General Information tab."
    ]
  },
  {
    "version": "1.2.2",
    "changes": [
      "Fix bug where active filters did not affect the messages exported.",
      "Adjustments to Attachment Modal.",
      "Style changes to Message Table."
    ]
  },
  {
    "version": "1.2.1",
    "changes": [
      "Fix bug where message filters did not reset behind the scenes.",
      "Rename 'About' tab to 'General Information', refactor layout."
    ]
  },
  {
    "version": "1.2.0",
    "changes": [
      "Add ability to export to the following file formats: HTML, PDF, and JSON.",
      "Behind the scenes performance enhancements."
    ]
  },
  {
    "version": "1.1.0",
    "changes": ["Add ability to filter messages by attachment name."]
  }
]
